PIMPLE_flow_past_cylinder/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         400;

deltaT          0.01;

writeControl    adjustableRunTime;

writeInterval   2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  15;

writeCompression off;

timeFormat      general;

timePrecision   6;

adjustTimeStep  yes;

runTimeModifiable yes;

maxCo           0.8;

maxDeltaT       1;

functions
{
    #include "forces"
//}


/*functions
{
  #include "graph";
*/
  probes
{
// Where to load it from
functionObjectLibs ( "libsampling.so" );

type        probes;

// Name of the directory for probe data
name        probes;

writeControl    outputTime;
writeInterval   1;
// Fields to be probed
fields (
         
        U
       );
interpolationScheme cellPointFace;
probeLocations
(

// Nx=200; Ny=1; Nz=1
(5.000000e-03   0.000000e+00    0.000000e+00)
(6.482412e-03   0.000000e+00    0.000000e+00)
(7.964824e-03   0.000000e+00    0.000000e+00)
(9.447236e-03   0.000000e+00    0.000000e+00)
(1.092965e-02   0.000000e+00    0.000000e+00)
(1.241206e-02   0.000000e+00    0.000000e+00)
(1.389447e-02   0.000000e+00    0.000000e+00)
(1.537688e-02   0.000000e+00    0.000000e+00)
(1.685930e-02   0.000000e+00    0.000000e+00)
(1.834171e-02   0.000000e+00    0.000000e+00)
(1.982412e-02   0.000000e+00    0.000000e+00)
(2.130653e-02   0.000000e+00    0.000000e+00)
(2.278894e-02   0.000000e+00    0.000000e+00)
(2.427136e-02   0.000000e+00    0.000000e+00)
(2.575377e-02   0.000000e+00    0.000000e+00)
(2.723618e-02   0.000000e+00    0.000000e+00)
(2.871859e-02   0.000000e+00    0.000000e+00)
(3.020101e-02   0.000000e+00    0.000000e+00)
(3.168342e-02   0.000000e+00    0.000000e+00)
(3.316583e-02   0.000000e+00    0.000000e+00)
(3.464824e-02   0.000000e+00    0.000000e+00)
(3.613065e-02   0.000000e+00    0.000000e+00)
(3.761307e-02   0.000000e+00    0.000000e+00)
(3.909548e-02   0.000000e+00    0.000000e+00)
(4.057789e-02   0.000000e+00    0.000000e+00)
(4.206030e-02   0.000000e+00    0.000000e+00)
(4.354271e-02   0.000000e+00    0.000000e+00)
(4.502513e-02   0.000000e+00    0.000000e+00)
(4.650754e-02   0.000000e+00    0.000000e+00)
(4.798995e-02   0.000000e+00    0.000000e+00)
(4.947236e-02   0.000000e+00    0.000000e+00)
(5.095477e-02   0.000000e+00    0.000000e+00)
(5.243719e-02   0.000000e+00    0.000000e+00)
(5.391960e-02   0.000000e+00    0.000000e+00)
(5.540201e-02   0.000000e+00    0.000000e+00)
(5.688442e-02   0.000000e+00    0.000000e+00)
(5.836683e-02   0.000000e+00    0.000000e+00)
(5.984925e-02   0.000000e+00    0.000000e+00)
(6.133166e-02   0.000000e+00    0.000000e+00)
(6.281407e-02   0.000000e+00    0.000000e+00)
(6.429648e-02   0.000000e+00    0.000000e+00)
(6.577889e-02   0.000000e+00    0.000000e+00)
(6.726131e-02   0.000000e+00    0.000000e+00)
(6.874372e-02   0.000000e+00    0.000000e+00)
(7.022613e-02   0.000000e+00    0.000000e+00)
(7.170854e-02   0.000000e+00    0.000000e+00)
(7.319095e-02   0.000000e+00    0.000000e+00)
(7.467337e-02   0.000000e+00    0.000000e+00)
(7.615578e-02   0.000000e+00    0.000000e+00)
(7.763819e-02   0.000000e+00    0.000000e+00)
(7.912060e-02   0.000000e+00    0.000000e+00)
(8.060302e-02   0.000000e+00    0.000000e+00)
(8.208543e-02   0.000000e+00    0.000000e+00)
(8.356784e-02   0.000000e+00    0.000000e+00)
(8.505025e-02   0.000000e+00    0.000000e+00)
(8.653266e-02   0.000000e+00    0.000000e+00)
(8.801508e-02   0.000000e+00    0.000000e+00)
(8.949749e-02   0.000000e+00    0.000000e+00)
(9.097990e-02   0.000000e+00    0.000000e+00)
(9.246231e-02   0.000000e+00    0.000000e+00)
(9.394472e-02   0.000000e+00    0.000000e+00)
(9.542714e-02   0.000000e+00    0.000000e+00)
(9.690955e-02   0.000000e+00    0.000000e+00)
(9.839196e-02   0.000000e+00    0.000000e+00)
(9.987437e-02   0.000000e+00    0.000000e+00)
(1.013568e-01   0.000000e+00    0.000000e+00)
(1.028392e-01   0.000000e+00    0.000000e+00)
(1.043216e-01   0.000000e+00    0.000000e+00)
(1.058040e-01   0.000000e+00    0.000000e+00)
(1.072864e-01   0.000000e+00    0.000000e+00)
(1.087688e-01   0.000000e+00    0.000000e+00)
(1.102513e-01   0.000000e+00    0.000000e+00)
(1.117337e-01   0.000000e+00    0.000000e+00)
(1.132161e-01   0.000000e+00    0.000000e+00)
(1.146985e-01   0.000000e+00    0.000000e+00)
(1.161809e-01   0.000000e+00    0.000000e+00)
(1.176633e-01   0.000000e+00    0.000000e+00)
(1.191457e-01   0.000000e+00    0.000000e+00)
(1.206281e-01   0.000000e+00    0.000000e+00)
(1.221106e-01   0.000000e+00    0.000000e+00)
(1.235930e-01   0.000000e+00    0.000000e+00)
(1.250754e-01   0.000000e+00    0.000000e+00)
(1.265578e-01   0.000000e+00    0.000000e+00)
(1.280402e-01   0.000000e+00    0.000000e+00)
(1.295226e-01   0.000000e+00    0.000000e+00)
(1.310050e-01   0.000000e+00    0.000000e+00)
(1.324874e-01   0.000000e+00    0.000000e+00)
(1.339698e-01   0.000000e+00    0.000000e+00)
(1.354523e-01   0.000000e+00    0.000000e+00)
(1.369347e-01   0.000000e+00    0.000000e+00)
(1.384171e-01   0.000000e+00    0.000000e+00)
(1.398995e-01   0.000000e+00    0.000000e+00)
(1.413819e-01   0.000000e+00    0.000000e+00)
(1.428643e-01   0.000000e+00    0.000000e+00)
(1.443467e-01   0.000000e+00    0.000000e+00)
(1.458291e-01   0.000000e+00    0.000000e+00)
(1.473116e-01   0.000000e+00    0.000000e+00)
(1.487940e-01   0.000000e+00    0.000000e+00)
(1.502764e-01   0.000000e+00    0.000000e+00)
(1.517588e-01   0.000000e+00    0.000000e+00)
(1.532412e-01   0.000000e+00    0.000000e+00)
(1.547236e-01   0.000000e+00    0.000000e+00)
(1.562060e-01   0.000000e+00    0.000000e+00)
(1.576884e-01   0.000000e+00    0.000000e+00)
(1.591709e-01   0.000000e+00    0.000000e+00)
(1.606533e-01   0.000000e+00    0.000000e+00)
(1.621357e-01   0.000000e+00    0.000000e+00)
(1.636181e-01   0.000000e+00    0.000000e+00)
(1.651005e-01   0.000000e+00    0.000000e+00)
(1.665829e-01   0.000000e+00    0.000000e+00)
(1.680653e-01   0.000000e+00    0.000000e+00)
(1.695477e-01   0.000000e+00    0.000000e+00)
(1.710302e-01   0.000000e+00    0.000000e+00)
(1.725126e-01   0.000000e+00    0.000000e+00)
(1.739950e-01   0.000000e+00    0.000000e+00)
(1.754774e-01   0.000000e+00    0.000000e+00)
(1.769598e-01   0.000000e+00    0.000000e+00)
(1.784422e-01   0.000000e+00    0.000000e+00)
(1.799246e-01   0.000000e+00    0.000000e+00)
(1.814070e-01   0.000000e+00    0.000000e+00)
(1.828894e-01   0.000000e+00    0.000000e+00)
(1.843719e-01   0.000000e+00    0.000000e+00)
(1.858543e-01   0.000000e+00    0.000000e+00)
(1.873367e-01   0.000000e+00    0.000000e+00)
(1.888191e-01   0.000000e+00    0.000000e+00)
(1.903015e-01   0.000000e+00    0.000000e+00)
(1.917839e-01   0.000000e+00    0.000000e+00)
(1.932663e-01   0.000000e+00    0.000000e+00)
(1.947487e-01   0.000000e+00    0.000000e+00)
(1.962312e-01   0.000000e+00    0.000000e+00)
(1.977136e-01   0.000000e+00    0.000000e+00)
(1.991960e-01   0.000000e+00    0.000000e+00)
(2.006784e-01   0.000000e+00    0.000000e+00)
(2.021608e-01   0.000000e+00    0.000000e+00)
(2.036432e-01   0.000000e+00    0.000000e+00)
(2.051256e-01   0.000000e+00    0.000000e+00)
(2.066080e-01   0.000000e+00    0.000000e+00)
(2.080905e-01   0.000000e+00    0.000000e+00)
(2.095729e-01   0.000000e+00    0.000000e+00)
(2.110553e-01   0.000000e+00    0.000000e+00)
(2.125377e-01   0.000000e+00    0.000000e+00)
(2.140201e-01   0.000000e+00    0.000000e+00)
(2.155025e-01   0.000000e+00    0.000000e+00)
(2.169849e-01   0.000000e+00    0.000000e+00)
(2.184673e-01   0.000000e+00    0.000000e+00)
(2.199497e-01   0.000000e+00    0.000000e+00)
(2.214322e-01   0.000000e+00    0.000000e+00)
(2.229146e-01   0.000000e+00    0.000000e+00)
(2.243970e-01   0.000000e+00    0.000000e+00)
(2.258794e-01   0.000000e+00    0.000000e+00)
(2.273618e-01   0.000000e+00    0.000000e+00)
(2.288442e-01   0.000000e+00    0.000000e+00)
(2.303266e-01   0.000000e+00    0.000000e+00)
(2.318090e-01   0.000000e+00    0.000000e+00)
(2.332915e-01   0.000000e+00    0.000000e+00)
(2.347739e-01   0.000000e+00    0.000000e+00)
(2.362563e-01   0.000000e+00    0.000000e+00)
(2.377387e-01   0.000000e+00    0.000000e+00)
(2.392211e-01   0.000000e+00    0.000000e+00)
(2.407035e-01   0.000000e+00    0.000000e+00)
(2.421859e-01   0.000000e+00    0.000000e+00)
(2.436683e-01   0.000000e+00    0.000000e+00)
(2.451508e-01   0.000000e+00    0.000000e+00)
(2.466332e-01   0.000000e+00    0.000000e+00)
(2.481156e-01   0.000000e+00    0.000000e+00)
(2.495980e-01   0.000000e+00    0.000000e+00)
(2.510804e-01   0.000000e+00    0.000000e+00)
(2.525628e-01   0.000000e+00    0.000000e+00)
(2.540452e-01   0.000000e+00    0.000000e+00)
(2.555276e-01   0.000000e+00    0.000000e+00)
(2.570101e-01   0.000000e+00    0.000000e+00)
(2.584925e-01   0.000000e+00    0.000000e+00)
(2.599749e-01   0.000000e+00    0.000000e+00)
(2.614573e-01   0.000000e+00    0.000000e+00)
(2.629397e-01   0.000000e+00    0.000000e+00)
(2.644221e-01   0.000000e+00    0.000000e+00)
(2.659045e-01   0.000000e+00    0.000000e+00)
(2.673869e-01   0.000000e+00    0.000000e+00)
(2.688693e-01   0.000000e+00    0.000000e+00)
(2.703518e-01   0.000000e+00    0.000000e+00)
(2.718342e-01   0.000000e+00    0.000000e+00)
(2.733166e-01   0.000000e+00    0.000000e+00)
(2.747990e-01   0.000000e+00    0.000000e+00)
(2.762814e-01   0.000000e+00    0.000000e+00)
(2.777638e-01   0.000000e+00    0.000000e+00)
(2.792462e-01   0.000000e+00    0.000000e+00)
(2.807286e-01   0.000000e+00    0.000000e+00)
(2.822111e-01   0.000000e+00    0.000000e+00)
(2.836935e-01   0.000000e+00    0.000000e+00)
(2.851759e-01   0.000000e+00    0.000000e+00)
(2.866583e-01   0.000000e+00    0.000000e+00)
(2.881407e-01   0.000000e+00    0.000000e+00)
(2.896231e-01   0.000000e+00    0.000000e+00)
(2.911055e-01   0.000000e+00    0.000000e+00)
(2.925879e-01   0.000000e+00    0.000000e+00)
(2.940704e-01   0.000000e+00    0.000000e+00)
(2.955528e-01   0.000000e+00    0.000000e+00)
(2.970352e-01   0.000000e+00    0.000000e+00)
(2.985176e-01   0.000000e+00    0.000000e+00)
(3.000000e-01   0.000000e+00    0.000000e+00)
);
}


/*
  fieldAverage
  {
    // Mandatory entries (unmodifiable)
    //type            fieldAverage;
    type                    fieldAverage;
        libs      ("libfieldFunctionObjects.so");
        enabled                 true;
        cleanRestart            false;
        outputControl           outputTime;
        resetOnOutput           false;
        resetOnRestart          false;
        timeStart       2000;
         timeEnd         20000;
    //libs            (fieldFunctionObjects);
    // Mandatory entries (runtime modifiable)
    fields
    (
       U
        {
            mean        on;
            prime2Mean  on;
            base        time;
         //   windowType   exact;
         //   window       100;
        //    windowName   <name>;
         //   allowRestart true;
        }
        p
        {
            mean        on;
            prime2Mean  off;
            base        time;
	 //   window      100;
       }
    );
    // Optional entries (runtime modifiable)
   /* restartOnRestart    false;
    restartOnOutput     false;
    periodicRestart     false;
    restartPeriod       0.002;
    // Optional (inherited) entries
    region          region0;
    enabled         true;
    log             true;
    timeStart       2000;
    timeEnd         20000;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    timeStep;
    writeInterval   1;
  }
//*/
}
// ************************************************************************* //
