PIMPLE_flow_past_cylinder/system/blockMeshDict-lite
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

// Geometric parameters

r   0.5; // cylinder radius
CPD   15; // cells per diameter
nz       1; // 2D set-up

rOuter  ${{ 2*$r }};
xmax    ${{ 25*$r }};;
xmin    ${{ -4*$r }};;  // <0
ymax    ${{ 6*$r }};;
ymin    ${{ -6*$r }};; // <0

radialGrading  6;
downstreamGrading 5;
upstreamGrading  2;
verticalGrading 5;


zmin   -0.5;  // Back/front locations
zmax    0.5;





// ----------------

// Derived quantities
rInner45    ${{ $r * sqrt(0.5) }};
rOuter45    ${{ $rOuter * sqrt(0.5) }};

nRadial  ${{round($CPD/2/$r*($rOuter-$r))}};
nQuarter ${{round(3.14159*$rOuter/8*(1+1/$radialGrading)/($rOuter-$r)*$nRadial)}};//10;
nxOuter_upstream  ${{round((1+1/$radialGrading)*(-$rOuter-$xmin)/(1+1/$upstreamGrading)/($rOuter-$r)*$nRadial/2)}};
nxOuter_downstream  ${{round((1+1/$radialGrading)*($xmax-$rOuter)/(1+$downstreamGrading)/($rOuter-$r)*$nRadial)}};;
nyOuter_up  ${{round(($ymax-$rOuter45)*2/(1+$verticalGrading)/$rOuter45*$nQuarter)}};
nyOuter_down $nyOuter_up;


radialGrading_inv ${{1/$radialGrading}};
verticalGrading_down ${{1/$verticalGrading}};
upstreamGrading_inv ${{1/$upstreamGrading}};

vertices #codeStream
{
    codeInclude
    #{
        #include "pointField.H"
    #};

    code
    #{
        pointField points
        ({
            /* 0*/ { $r, 0, $zmin },
            /* 1*/ { $rOuter, 0, $zmin },
            /* 2*/ { $xmax, 0, $zmin },
            /* 3*/ { $xmax, $rOuter45, $zmin },
            /* 4*/ { $rOuter45, $rOuter45, $zmin },
            /* 5*/ { $rInner45, $rInner45, $zmin },
            /* 6*/ { $xmax, $ymax, $zmin },
            /* 7*/ { $rOuter45, $ymax, $zmin },
            /* 8*/ { 0, $ymax, $zmin },
            /* 9*/ { 0, $rOuter, $zmin },
            /*10*/ { 0, $r, $zmin },
            /*11*/ { -$r, 0, $zmin },
            /*12*/ { -$rOuter, 0, $zmin },
            /*13*/ {  $xmin, 0, $zmin },
            /*14*/ {  $xmin, $rOuter45, $zmin },
            /*15*/ { -$rOuter45, $rOuter45, $zmin },
            /*16*/ { -$rInner45, $rInner45, $zmin },
            /*17*/ {  $xmin, $ymax, $zmin },
            /*18*/ { -$rOuter45, $ymax, $zmin },

            /* 19*/ { $r, 0, $zmin },
            /* 20*/ { $rOuter, 0, $zmin },
            /* 21*/ { $xmax, 0, $zmin },
            /* 22*/ { $xmax, -$rOuter45, $zmin },
            /* 23*/ { $rOuter45, -$rOuter45, $zmin },
            /* 24*/ { $rInner45, -$rInner45, $zmin },
            /* 25*/ { $xmax, $ymin, $zmin },
            /* 26*/ { $rOuter45, $ymin, $zmin },
            /* 27*/ { 0, $ymin, $zmin },
            /* 28*/ { 0, -$rOuter, $zmin },
            /*29*/ { 0, -$r, $zmin },
            /*30*/ { -$r, 0, $zmin },
            /*31*/ { -$rOuter, 0, $zmin },
            /*32*/ {  $xmin, 0, $zmin },
            /*33*/ {  $xmin, -$rOuter45, $zmin },
            /*34*/ { -$rOuter45, -$rOuter45, $zmin },
            /*35*/ { -$rInner45, -$rInner45, $zmin },
            /*36*/ {  $xmin, $ymin, $zmin },
            /*37*/ { -$rOuter45, $ymin, $zmin }
        });

        // Duplicate z points for zmax
        const label sz = points.size();
        points.resize(2*sz);
        for (label i = 0; i < sz; ++i)
        {
            const point& pt = points[i];
            points[i + sz] = point(pt.x(), pt.y(), $zmax);
        }

        os  << points;
    #};
};

// Can remove unneeded variables
#remove ( "r(Inner|Outer).*"  "[xy](min|max)" )

blocks
(
    hex (5 4 9 10 43 42 47 48)    ($nRadial  $nQuarter $nz) grading ($radialGrading 1 1) // 0
    hex (0 1 4 5 38 39 42 43)     ($nRadial  $nQuarter $nz) grading ($radialGrading 1 1) // 1
    hex (1 2 3 4 39 40 41 42)     ($nxOuter_downstream  $nQuarter $nz) grading ($downstreamGrading 1 1) // 2
    hex (4 3 6 7 42 41 44 45)     ($nxOuter_downstream  $nyOuter_up  $nz) grading ($downstreamGrading $verticalGrading 1) // 3
    hex (9 4 7 8 47 42 45 46)     ($nQuarter $nyOuter_up  $nz) grading (1 $verticalGrading 1) // 4
    hex (15 16 10 9 53 54 48 47)  ($nRadial  $nQuarter $nz) grading ($radialGrading_inv 1 1) // 5
    hex (12 11 16 15 50 49 54 53) ($nRadial  $nQuarter $nz) grading ($radialGrading_inv 1 1) // 6
    hex (13 12 15 14 51 50 53 52) ($nxOuter_upstream  $nQuarter $nz) grading ($upstreamGrading_inv 1 1) // 7
    hex (14 15 18 17 52 53 56 55) ($nxOuter_upstream  $nyOuter_up  $nz) grading ($upstreamGrading_inv $verticalGrading 1) // 8
    hex (15 9 8 18 53 47 46 56)   ($nQuarter $nyOuter_up  $nz) grading (1 $verticalGrading 1) // 9


    hex (29 28 23 24 67 66 61 62)    ($nRadial  $nQuarter $nz) grading ($radialGrading 1 1) // 10
    hex (24 23 20 19 62 61 58 57)     ($nRadial  $nQuarter $nz) grading ($radialGrading 1 1) // 11
    hex (23 22 21 20 61 60 59 58)     ($nxOuter_downstream  $nQuarter $nz) grading ($downstreamGrading 1 1) // 12
    hex ( 26 25 22 23 64 63 60 61)     ($nxOuter_downstream  $nyOuter_down  $nz) grading ($downstreamGrading $verticalGrading_down 1) // 13
    hex ( 27 26 23 28 65 64 61 66)     ($nQuarter $nyOuter_down  $nz) grading (1 $verticalGrading_down 1) // 14
    hex (28 29 35 34 66 67 73 72)  ($nRadial  $nQuarter $nz) grading ($radialGrading_inv 1 1) // 15
    hex (34 35 30 31 72 73 68 69) ($nRadial  $nQuarter $nz) grading ($radialGrading_inv 1 1) // 16
    hex (33 34 31 32 71 72 69 70) ($nxOuter_upstream  $nQuarter $nz) grading ($upstreamGrading_inv 1 1) // 17
    hex (36 37 34 33 74 75 72 71) ($nxOuter_upstream  $nyOuter_down  $nz) grading ($upstreamGrading_inv $verticalGrading_down 1) // 18
    hex (37 27 28 34 75 65 66 72)   ($nQuarter $nyOuter_down  $nz) grading (1 $verticalGrading_down 1) // 19
);

edges
(
    // Inner cylinder (up)
    arc  0  5 origin (0 0 $zmin)
    arc  5 10 origin (0 0 $zmin)
    arc  1  4 origin (0 0 $zmin)
    arc  4  9 origin (0 0 $zmin)
    arc 38 43 origin (0 0 $zmax)
    arc 43 48 origin (0 0 $zmax)
    arc 39 42 origin (0 0 $zmax)
    arc 42 47 origin (0 0 $zmax)
    // Intermediate cylinder (up)
    arc 11 16 origin (0 0 $zmin)
    arc 16 10 origin (0 0 $zmin)
    arc 12 15 origin (0 0 $zmin)
    arc 15  9 origin (0 0 $zmin)
    arc 49 54 origin (0 0 $zmax)
    arc 54 48 origin (0 0 $zmax)
    arc 50 53 origin (0 0 $zmax)
    arc 53 47 origin (0 0 $zmax)

    // Inner cylinder (down)
    arc  19  24 origin (0 0 $zmin)
    arc  24 29 origin (0 0 $zmin)
    arc  20  23 origin (0 0 $zmin)
    arc  23  28 origin (0 0 $zmin)
    arc 57 62 origin (0 0 $zmax)
    arc 62 67 origin (0 0 $zmax)
    arc 58 61 origin (0 0 $zmax)
    arc 61 66 origin (0 0 $zmax)
    // Intermediate cylinder (down)
    arc 30 35 origin (0 0 $zmin)
    arc 35 29 origin (0 0 $zmin)
    arc 31 34 origin (0 0 $zmin)
    arc 34 28 origin (0 0 $zmin)
    arc 68 73 origin (0 0 $zmax)
    arc 73 67 origin (0 0 $zmax)
    arc 69 72 origin (0 0 $zmax)
    arc 72 66 origin (0 0 $zmax)
);

boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
          	(1 0 5 4)
          	(10 9 4 5)
         	(16 15 9 10 )
          	(11 12 15 16)
		( 2 1 4 3)
		(4 7 6 3)
		(4 9 8 7)
		(9 15 18 8)
		(14 17 18 15)
		(12 13 14 15)

		(19 20 23 24)
		(24 23 28 29)
		(29 28 34 35)
		(35 34 31 30)
		(21 22 23 20)
		(23 22 25 26)
		(28 23 26 27)
		(34 28 27 37)
		(33 34 37 36)
		(32 31 33 34)//*/

          	(42 43 38 39)
          	(43 42 47 48)
         	(48 47 53 54)
          	(54 53 50 49)
		(41 42 39 40)
		(41 44 45 42)
		(45 46 47 42)
		(46 56 53 47)
		(53 56 55 52)
		(53 52 51 50)

		(62 61 58 57)
		(67 66 61 62)
		(73 72 66 67)
		(68 69 72 73)
		(58 61 60 59)
		(64 63 60 61)
		(65 64 61 66)
		(75 65 66 72)
		(74 75 72 71)
		(72 71 69 70)//*/
        );
    }//*/
    outlet
    {
        type patch;
        faces
        (
            (2 3 41 40)
            (3 6 44 41)
            (59 60 22 21)
            (60 63 25 22)
        );
    }
    up
    {
        type patch;
        faces
        (
            (7 8 46 45)
            (6 7 45 44)
            (8 18 56 46)
            (18 17 55 56)
        );
    }
    down
    {
        type patch;
        faces
        (
            (64 65 27 26)
            (63 64 26 25)
            (65 75 37 27)
            (75 74 36 37)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (14 13 51 52)
            (17 14 52 55)
            (71 70 32 33)
            (74 71 33 36)
        );
    }
    cylinder
    {
        type patch;
        faces
        (
            (10 5 43 48)
            (5 0 38 43)
            (16 10 48 54)
            (11 16 54 49)
            (67 62 24 29)
            (62 57 19 24)
            (73 67 29 35)
            (68 73 35 30)
        );
    }
);//*/

mergePatchPairs
(
);//*/


// ************************************************************************* //
