PIMPLE_flow_past_cylinder/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet
    {
        type            fixedValue; //zeroGradient;
        value uniform 0;
    }

    inlet
    {
        type            zeroGradient;
    }
    down
    {   
        type            zeroGradient;//totalPressure;
       // p0              uniform 0;
    } 
    up
    {   
        type   zeroGradient; //        totalPressure;
       // p0              uniform 0;
    } 
    cylinder
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }

    wedge1{type wedge;}
    wedge2{type wedge;}
}


// ************************************************************************* //
