PIMPLE_flow_past_cylinder/0/curv
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      curv;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
36656
(
3814.79132381494
0
2.12197894394344e-13
1.65263680892743e-13
0
1.95661017448757e-13
1.48534982104049e-13
0
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 
259
(
0
2.33753220830119e-13
0
2.33288157464472e-13
0
2.32471049322361e-13
2.31940288630988e-13
2.31334864573645e-13
...
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<scalar> 
259
(
2.33847202128871e-13
6.00362276155482e-14
6.61466862570674e-15
3.02089938279188e-13
1.71051986764494e-13
1.03068219133156e-13
6.34211726725358e-14
2.53022508127424e-14
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    cylinder
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
